<html>
<head>
   <title>aCiDBaSe HoMe PaGe</title>
   <link rel="STYLESHEET" href="../estilos.css">
</head>

<body bgcolor="#000000">
<pre>
                         xx
                xxxx     xx    xxxx    xxxxx            xxxx
               xx  xx          xx xx   xx  xx          xx  xx
        xxxx   xx  xx  xxxx    xx  xx  xx  xx   xxxx   xx       xxxx
           xx  xx        xx    xx  xx  xx  xx      xx   xx     xx  xx
           xx  xx        xx    xx  xx  xxxxx       xx    xx    xx  xx
        xxxxx  xx        xx    xx  xx  xx  xx   xxxxx     xx   xxxxxx
       xx  xx  xx  xx    xx    xx  xx  xx  xx  xx  xx      xx  xx
       xx  xx  xx  xx    xx    xx xx   xx  xx  xx  xx  xx  xx  xx
        xxxxx   xxxx   xxxxxx  xxxx    xxxxx    xxxxx   xxxx    xxxx
        H      o      M      e                P      a      G      e


<b>Configura&ccedil;&atilde;o de modem HSF
Conexant (Rockwell)</b>
-------------------------+
                         |
-------------------------+--------------------------------------------------

por Roberto Janny T. J. (krivilli) &lt;<a href="mailto:rj@crovax.zzn.com">rj@crovax.zzn.com</a>&gt;

<b>1. Uma Vis&atilde;o Geral:</b>

<i>Winmodems</i> podem ser uma dor de cabe&ccedil;a, e ainda mais: nem
s&atilde;o "modems" verdadeiros! O uso de m&oacute;dulos bin&aacute;rios
n&atilde;o oferece qualquer suporte formal, portanto, se voc&ecirc; tiver
problemas estes ficam por sua pr&oacute;pria conta e risco. Mas voc&ecirc;
j&aacute; deveria saber disso :)

A hist&oacute;ria &eacute; a seguinte: um dia desses, resolvi tirar do velho
ba&uacute; um modem que eu j&aacute; n&atilde;o utilizava fazia um bom tempo.
Era um desses (PCI) que n&atilde;o tinham suporte no Linux: o <b>Winmodem
Conexant (Rockwell) HSF</b>.

Ent&atilde;o empreendi uma busca pela rede e descobri informa&ccedil;&otilde;es
bem interessantes: que existem drivers (controladores de dispositivo) para este
modem. N&atilde;o exatamente para este modem, mas que funciona tamb&eacute;m
para ele.

Parece que os "modems" Conexant (Rockwell) HSF funcionam com os drivers
(dispon&iacute;veis apenas como bin&aacute;rios) fornecidos pela <a
href="http://www.olitec.com/linux.htm">Olitec</a>, e &eacute; poss&iacute;vel
usar esses drivers com os kernels 2.2.14, 2.2.16 e 2.2.17. Algum tempo
atr&aacute;s, a Olitec disponibilizou um driver (apenas bin&aacute;rio) para os
seus "modems".

<b>2. AVISO Primeiro:</b>

Espero que essas informa&ccedil;&otilde;es sejam, de algum modo, &uacute;teis
para aqueles que possuam um desses "modems". Mas n&atilde;o reclame comigo se
nada funcionar, e evite mandar e-mails dizendo algo do tipo "Como eu consigo
fazer meu winmodem funcionar...". N&atilde;o me responsabilizo por nada que
acontecer ao seu computador, &agrave; sua casa, etc...

<b>3. AVISO Segundo:</b>

J&aacute; vou alertando: aqueles que seguem estreitamente os ideais da
filosofia GNU n&atilde;o se sentir&atilde;o confort&aacute;veis com essa
solu&ccedil;&atilde;o, pois o drivers s&atilde;o propriet&aacute;rios (hum...)!
Dispon&iacute;veis apenas como bin&aacute;rios. A melhor coisa seria comprar um
modem de verdade, e tudo estaria resolvido, certo? Nem para todos do mundo
real. Eu tamb&eacute;m levo assaz seriamente tudo que corresponde ao <i>Free
Software</i>, ao movimento <i>OpenSource</i> e ao GNU, mas por utilizar esse
procedimento (mesmo que seja tempor&aacute;rio; logo que conseguir um cable
modem externo, tudo volta para o seu devido lugar, ou melhor, para o velho
ba&uacute; :) ), n&atilde;o me considero um herege completo.

<b>3. Obtendo algumas informa&ccedil;&otilde;es no Windows. Mas nada muito doloroso, espero :)</b>

Voc&ecirc; pode obter essas informa&ccedil;&otilde;es de duas maneiras:

	 - Clique em "Iniciar/Configura&ccedil;&otilde;es/Painel de Controle",
	   ent&atilde;o clique em "Sistema". Clique na guia "Gerenciador de
	   Dispositivos"; depois d&ecirc; um clique duplo na entrada "HSFMODEM";
	   d&ecirc; outro clique duplo em "Rockwell PCI Modem Enumerator";
	   novamente um clique duplo, ent&atilde;o v&aacute; at&eacute; a guia
	   "Recursos": anote os dados ali presentes (IRQ e intervalo de
	   mem&oacute;ria) para o posterior uso na identifica&ccedil;&atilde;o de
       mais informa&ccedil;&otilde;es no Linux.

	 - Voc&ecirc; tamb&eacute;m pode obter essa informa&ccedil;&otilde;es (no
	   Windows 98), a partir de um prompt (DOS) aberto, com o comando:

		C:\&gt; hwinfo /ui

<b>4. Baixando os Drivers:</b>

Pode-se baixar os drivers direto do site <a
href="http://www.olitec.com/linux.html">http://www.olitec.com/linux.html</a>.
Neste exemplo, utilizou-se o pacote <b>HSF_V1.01.02_K2.2.14-5.0.tar</b>.

Veja que baixei o driver para a vers&atilde;o do o meu kernel (2.2.14). Tenha
certeza de ter o suporte PPP habilitado no kernel <b>(CONFIG_PPP=y)</b>. O
carregador de m&oacute;dulos do kernel tamb&eacute;m deve estar habilitado
<b>(CONFIG_KMOD=y)</b>. Voc&ecirc; precisa desse &uacute;ltimo para
m&oacute;dulos comprimidos, pois estes n&atilde;o podem ser compilados dentro
do kernel.

<b>5. Instala&ccedil;&atilde;o &amp; Configura&ccedil;&atilde;o:</b>

Descompacte o driver:

# tar -xzvf HSF_V1_01_02_K2_2_14-5_0.tar

Isso criar&aacute; um novo diret&oacute;rio PCI_56K_V2. Entre nesse
diret&oacute;rio e abra o arquivo <b>ins_all</b>. No final desse arquivo
existem 10 linhas referentes ao <b>insmod</b>. Iremos for&ccedil;ar a
inser&ccedil;&atilde;o dos m&oacute;dulos adicionando a op&ccedil;&atilde;o
"f". As linhas deveriam parecer com algo como isso:

insmod -mf fsks_mod.o &gt;&gt; modem.map
insmod -mf tones_mod.o &gt;&gt; modem.map
insmod -mf v34module.o &gt;&gt; modem.map
insmod -mf v90_mod.o &gt;&gt; modem.map
insmod -mf fbks_mod.o &gt;&gt; modem.map
insmod -mf mod_octopus.o &gt;&gt; modem.map
insmod -mf mod_basic2.o &gt;&gt; modem.map
insmod -mf mod_dev_mgr.o &gt;&gt; modem.map
insmod -mf mod_session_ctrl.o &gt;&gt; modem.map
insmod -mf myserial.o &gt;&gt; modem.map

Existem mais duas linhas do <b>insmod</b> acima. Adicione tamb&eacute;m a
op&ccedil;&atilde;o "f".

Em seguida rode o seguinte comando (finalmente, &eacute; aqui que voc&ecirc;
vai usar aquelas informa&ccedil;&otilde;es pegas no Windows):

# cat /proc/pci | less

De posse daqueles n&uacute;meros pegos anteriormente, procure, na sa&iacute;da
gerada pelo comando acima, por entradas semelhantes: em <i>Device id</i> e em
<i>Vendor id</i>. Ent&atilde;o os anote. No meu caso, isso &eacute; o que eu
procurava:

Bus  0, device  15, function  0:
Non-VGA device: Unknown vendor Unknown device (rev 1).
Vendor id=127a. Device id=2005.
Medium devsel.  Fast back-to-back capable.  IRQ 10.  Master Capable.
Latency=64
Non-prefetchable 32 bit memory at 0xe4000000 [0xe4000000].
I/O at 0x6800 [0x6801].

Agora abra o arquivo <b>lin_hsf.inf</b> e insira a seguintes linhas abaixo do campo <b>[Generic]</b>:

%HSFModem% = ModemX, PCI\VEN_XXXX&amp;DEV_YYYY&amp;SUBSYS_YYYYXXXX

Substitua o '<b>XXXX</b>'; pelo seu Vendor id e o '<b>YYYY</b>'; pelo seu
Device id.

Ap&oacute;s a etapa acima descrita, na linha de comando rode o seguinte:

# ./hsf_linstall.pl
# ./ins_all

Verifique se os m&oacute;dulos est&atilde;o carregados atrav&eacute;s do
comando <b>lsmod</b>. Se os m&oacute;dulos est&atilde;o carregados mas
voc&ecirc; recebeu um 'core dumped', eles n&atilde;o ir&atilde;o funcionar.
Inicie o <b>minicon</b> e veja se o modem responde aos comandos; disque um
n&uacute;mero. Se tudo estiver certo, estaremos quase terminando.

Voc&ecirc; tamb&eacute;m pode inserir o seguinte em seu
<b>/etc/modules.conf</b> (para uso posterior):

alias ppp-compress-21  bsd_comp
alias ppp-compress-24  ppp_deflate
alias ppp-compress-26  ppp_deflate

Lembre-se que na primeira tentativa de discar (pode-se utilizar o programa
wvdial para fazer a sua conex&atilde;o com o seu provedor de internet) o modem
pode estar ocupado. Ent&atilde;o tente outra vez. Certas mensagens de erro que
podem aparecer no <b>/var/log/messages</b> sempre acontecem. Alguns ponteiros
de mem&oacute;ria podem n&atilde;o ser encontrados, mas mesmo assim ele
funciona.

&Eacute; poss&iacute;vel que a string de inicializa&ccedil;&atilde;o padr&atilde;o do wvdial trave o sistema. Pode-se altera-la para ATX1.

<b>6. Desinstala&ccedil;&atilde;o:</b>

O seguinte comando deve resolver:

# ./rm_all

<b>FAQ</b>

1. Consegui instalar e configurar normalmente o modem Conexant SoftK56 PCI, bem
como comunicar com o modem via comandos AT (atrav&eacute;s do minicom, por
exemplo). No entanto n&atilde;o consigo discar qualquer n&uacute;mero. Quanto
tento conectar-me a interne com o <i>kppp</i>, obtenho a mensagem "NODIALTONE".
Qual o problema?

<i>Experimente aumentar o n&uacute;mero de tentativas de discagem para 5.
Voc&ecirc; tamb&eacute;m pode tentar a seguinte string de
inicializa&ccedil;&atilde;o:</i>

AT&amp;FE1V1S0=0X3&amp;C1&amp;D1&amp;D2+MR=2;+DR=1;+ER=1;W0

<i>A prov&aacute;vel raz&atilde;o de voc&ecirc; n&atilde;o estar conseguindo
tom para discagem &eacute; porque o driver est&aacute; configurado para o
sistema de telefonia francesa.</i>

2. Consegui fazer o <i>modem</i> discar usando o driver da Olitec, mas
n&atilde;o fiu capaz de me conectar ao meu ISP. Ele disca o n&uacute;mero de
conex&atilde;o, aceita a chamada, mas depois nada ocorre. E ap&oacute;s algum
tempo recebo o erro "NOCARRIER". Qual &eacute; o motivo desse problema?

<i>Pode ser problema com o seu ISP. Tente conectar mais algumas vezes, ou tente
outra vez mais tarde.</i>

3. Quando executo o script de instala&ccedil;&atilde;o, obtenho um erro a
respeito do <b>hfs_install.log</b>. Quando verifico o arquivo log de
instala&ccedil;&atilde;o diz que o arquivo inf est&aacute; faltando e
est&aacute; presente no mesmo diret&oacute;rio. Por que eu estou tendo este
problema? Existe algum diret&oacute;rio no qual eu devo proceder a
instala&ccedil;&atilde;o?

<i>Verifique se o arquivo</i> <b>lin_hsf.inf</b> <i>est&aacute; editado corretamente, conforme descrito acima.</i>

<b>Bibliografia:</b>

  - <a href="http://www.mandrakeforum.com">http://www.mandrakeforum.com</a>
  - <a href="http://linmodems.org">http://linmodems.org</a>
  - <a href="http://www.olitec.com/linux.html">http://www.olitec.com/linux.html</a>
  - <a href="http://www.808hi.com/56k/rockhcf.htm">http://www.808hi.com/56k/rockhcf.htm</a>
</pre>
</body>
</html>
