<html>
<head>
	<title>Internacionaliza&ccedil;&atilde;o</title>
</head>

<body bgcolor="#FFFFFF">
<h1>Internacionaliza&ccedil;&atilde;o</h1>

<p>por Osvaldo Santana Neto <tt>&lt;<a href="mailto:acidbase@bigfoot.com">acidbase@bigfoot.com</a>&gt;</tt> e Andreia Soares Farias <tt>&lt;<a href="mailto:andreia@conectiva.com.br">andreia@conectiva.com.br</a>&gt;</tt></p>

<p>Muitas vezes as pessoas que come&ccedil;am a trabalhar com Software Livre gostariam de saber como podem contribuir com a comunidade e n&atilde;o sabem. Uma coisa &eacute; certa, trabalho &eacute; o que n&atilde;o falta. Voc&ecirc; pode escrever documenta&ccedil;&atilde;o, programar, reportar bugs, convencer pessoas a usarem software livre e... internacionalizar programas.</p>

<p>Internacionalizar (i18n) um programa consiste em adaptar o mesmo para que ele atenda &agrave;s necessidades de v&aacute;rios pessoas em todo mundo, n&atilde;o importando o idioma, sistema monet&aacute;rio, alfabeto, formato de data e medidas. Internacionaliza&ccedil;&atilde;o de programas &eacute; um assunto extenso demais para ser tratado em apenas um artigo de uma revista, portanto iremos explicar aqui apenas como se fazer a "localiza&ccedil;&atilde;o" de um programa. Ou seja, adaptar o programa para que as mensagens sejam traduzidas para qualquer idioma.</p>

<p>Pessoas que traduzem um programa direto no seu c&oacute;digo fonte n&atilde;o est&atilde;o fazendo esse trabalho de forma correta. Para esse tipo de trabalho a <tt>glibc</tt> e o pacote <tt>gettext</tt> fornecem as ferramentas necess&aacute;rias. A <tt>glibc</tt> fornece fun&ccedil;&otilde;es para o uso desses recursos em tempo de execu&ccedil;&atilde;o do programa e o pacote <tt>gettext</tt> fornece as ferramentas para extra&ccedil;&atilde;o, compila&ccedil;&atilde;o (que ser&aacute; explicado adiante) e merge dos arquivos com as mensagens internacionalizadas. Assumiremos aqui que voc&ecirc; j&aacute; tenha conhecimento em linguagem C.<p>

<p>Acho que a melhor maneira de explicar como fazemos isso &eacute; por meio de exemplos, ent&atilde;o vamos l&aacute;.</p>

<h2>Obtendo os fontes do programa</h2>

<p>Como exemplo usaremos um pseudo-programa chamado (adivinhem!) Hello World. Pegaremos esse programa de algum lugar e iremos localizar o mesmo.</p>

<pre>
$ tar zxvf <a href="../download/hello-0.0.1.tar.bz2">helloworld-0.0.1.tar.bz2</a>
</pre>

<p>Dica: fa&ccedil;a uma c&oacute;pia desse diret&oacute;rio. Ex.: <tt>cp helloworld-0.0.1 helloworld-0.0.1.orig</tt>.</p>

<p>Esse programa cont&eacute;m apenas um arquivo <tt>hello.c</tt> com o conte&uacute;do:</p>

<pre>
/* hello.c */
#include &lt;stdio.h&gt;
int main()
{
   char *test[] = { "English", "Hello", "Beautiful" };
   printf("%s: %s World!\n%s day!\n", 
          test[0], test[1], test[2]);
}
</pre>

<p>Compilando e executando esse programa iremos obter a seguinte sa&iacute;da:</p>

<pre>
$ ./hello
English: Hello World!
Beautiful day!
</pre>

<p>O mais afoito iria traduzir todos os textos entre aspas para o portugu&ecirc;s. Isso obrigaria ao usu&aacute;rio da espanha fazer o mesmo em todo o programa fonte e o chin&ecirc;s, e o ... Poder&iacute;amos de alguma forma tornar esse trabalho &uacute;til para todas as pessoas do mundo. Como? Marcando nos fontes do programa todas as mensagens que s&atilde;o traduz&iacute;veis. Para fazer essa marca&ccedil;&atilde;o usaremos o s&iacute;mbolo "_" para textos do programa e "N_" para marcar as strings usadas para iniciar as vari&aacute;veis. Esses marcadores s&atilde;o os normalmente utilizados na maioria dos trabalhos de localiza&ccedil;&atilde;o, portanto n&atilde;o fugiremos &agrave; regra.</p>

<pre>
/* hello.c */
#include &lt;stdio.h&gt;
int main()
{
   char *test[] = { N_("English"), N_("Hello"), N_("Beautiful") };
   printf(_("%s: %s World!\n%s day!\n"),
          test[0], test[1], test[2]);
}
</pre>

<p>Agora com as strings sinalizadas poderemos posteriormente extra&iacute;-las para um arquivo separado, chamado potfile, com o programa <tt>xgettext</tt> para iniciarmos o processo de tradu&ccedil;&atilde;o.</p>

<p>Mas n&atilde;o &eacute; s&oacute; isso. Agora teremos que modificar o programa para que ele suporte realmente mensagens traduzidas em outros idiomas. Para isso primeiramente deveremos incluir o arquivo de cabe&ccedil;alho <tt>libintl.h</tt> e definir os s&iacute;mbolos "N_" e "_". No in&iacute;cio do arquivo acrescente:</p>

<pre>
/* hello.c */
#include &lt;libintl.h&gt;
#define _(x) gettext(x)
#define N_(x) (x)
</pre>

<p>O arquivo de cabe&ccedil;alho <tt>libintl.h</tt> cont&eacute;m a defini&ccedil;&atilde;o da fun&ccedil;&atilde;o <tt>gettext</tt> e de outras que usaremos posteriormente. A fun&ccedil;&atilde;o <tt>gettext</tt> tem a fun&ccedil;&atilde;o de substituir, durante a execu&ccedil;&atilde;o do programa o texto da mensagem para o idioma definido no locale da m&aacute;quina. O locale de uma m&aacute;quina indica em qual regi&atilde;o do mundo e qual idioma falado nessa regi&atilde;o. Para ver qual o locale setado na m&aacute;quina voc&ecirc; pode usar o comando <tt>locale</tt>. As vari&aacute;veis com os locales ser&atilde;o mostradas no formato xx_YY onde xx cont&eacute;m a sigla do idioma e YY a regi&atilde;o onde ele &eacute; usado. Os s&iacute;mbolos "N_" n&atilde;o ser&atilde;o substitu&iacute;dos por nada e servem apenas para marcar as mensagens para extra&iacute;-las posteriormente.</p>

<p>Como os s&iacute;mbolos "N_" n&atilde;o ser&atilde;o substituidos por nada, precisamos fazer um la&ccedil;o para traduzir o conte&uacute;do do vetor test. Esse la&ccedil;o ficar&aacute; como:</p>

<pre>
   :
   char *test[] = { N_("English"), N_("Hello"), N_("Beautiful") };
   int i;
   for (i = 0; i &lt; (sizeof(test)/sizeof(char *)); i++)
      test[i] = _(test[i]);
   :
</pre>

<p>Isso far&aacute; com que todos os elementos do vetor <tt>test</tt> sejam traduzidos para serem usados posteriormente.</p>

<p>Bom agora precisamos fazer nosso programa ler o locale e setar as configura&ccedil;&otilde;es para que a fun&ccedil;&atilde;o <tt>gettext</tt> possa funcionar corretamente. No <tt>libintl.h</tt> existe as defini&ccedil;&otilde;es das fun&ccedil;&otilde;es <tt>bindtextdomain</tt> e <tt>textdomain</tt>. Elas funcionam basicamente da seguinte maneira:</p>

<pre>
   :
   char *test[] = { N_("English"), N_("Hello"), N_("Beautiful") };
   int i;
   bindtextdomain("hello", "/usr/share/locale");
   textdomain("hello");
   for (i = 0; i &lt; (sizeof(test)/sizeof(char *)); i++)
      test[i] = _(test[i]);
   :
</pre>

<p>A fun&ccedil;&atilde;o <tt>bindtextdomain</tt> recebe como par&acirc;metros o nome do final do programa e o diret&oacute;rio onde ficar&atilde;o os arquivos com os potfiles compilados pelo comando <tt>msgfmt</tt>. E a fun&ccedil;&atilde;o <tt>textdomain</tt> recebe como par&acirc;menteo apenas o nome final do programa.</p>

<p>Terminamos o processo de internacionaliza&ccedil;&atilde;o do programa. Agora precisamos traduz&iacute;-lo. Para fazer isso precisaremos extrair as strings que tinhamos marcado. Para essa tarefa usaremos o comando <tt>xgettext</tt>. Para extra&iacute;rmos as mensagens do programa <tt>hello.c</tt> usaremos o comando:</p>

<pre>
# xgettext -a --keyword=_ --keyword=N_ hello.c -o hello.pot
</pre>

<p>Isso ir&aacute; criar o arquivo <tt>hello.pot</tt> que conter&aacute; o esqueleto para o arquivo de tradu&ccedil;&atilde;o. Copie esse arquivo para outro chamado <tt>pt_BR.po</tt> que conter&aacute; as tradu&ccedil;&otilde;es para o portugu&ecirc;s do Brasil (voc&ecirc; poder&aacute; ver uma listagem das siglas dos idiomas na infopage do <tt>gettext</tt>, recomendo fortemente que voc&ecirc; leia essa infopage para maiores informa&ccedil;&otilde;es sobre esse assunto). O arquivo <tt>pt_BR.po</tt> dever&aacute; conter um cabe&ccedil;alho que dever&aacute; ser preenchido conforme o solicitado e as mensagens que est&atilde;o nesse formato (as tradu&ccedil;&otilde;es ficar&atilde;o em <tt>msgstr</tt> e o texto original em <tt>msgid</tt>) j&aacute; traduzido:</p>

<pre>
#: teste.c:9
msgid "Hello"
msgstr "Ol&aacute;"

msgid ""
"%s: %s World!\n"
"%s day!\n"
msgstr ""
"%s: %s Mundo\n"
"Dia %s!\n"
</pre>

<p>Note que nessa &uacute;ltima mensagem n&oacute;s devemos manter os caracteres de formata&ccedil;&atilde;o e controle intactos. Note tamb&eacute;m que invertemos a ordem da palavra "day" e sua respectiva tradu&ccedil;&atilde;o porque no ingl&ecirc;s o adjetivo vem sempre antes do substantivo e no portugu&ecirc;s isso nem sempre &eacute; verdade. Portanto &eacute; necess&aacute;rio uma aten&ccedil;&atilde;o especial para esses casos. Cuidado tamb&eacute;m em manter sempre a mesma ordem dos caracteres de formata&ccedil;&atilde;o (ex.: "%s") pois o <tt>printf</tt> receber&aacute; as vari&aacute;veis com o conte&uacute;do nessa string numa ordem espec&iacute;fica. Existem casos onde <tt>xgettext</tt> coloca um coment&aacute;rio "#, fuzzy" no arquivo .po que indica que pode existir algum problema na tradu&ccedil;&atilde;o. Verifique isso, corrija se necess&aacute;rio e remova esse coment&aacute;rio.</p>

<p>Agora devemos "compilar" nosso arquivo potfile. Para isso usamos o comando <tt>msgfmt</tt> conforme abaixo:</p>

<pre>
# msgfmt -vv pt_BR.po /usr/share/locale/pt_BR/LC_MESSAGES/hello.mo
</pre>

<p>Note que o arquivo .mo deve ficar dentro da &aacute;rvore correspondente ao idioma e deve ter o mesmo nome referenciado em <tt>bindtextdomain</tt> com a extens&atilde;o .mo. Depois disso &eacute; s&oacute; recompilar e executar o programa para test&aacute;-lo.</p>

<pre>
# make hello
# ./hello
Portugu&ecirc;s: Ol&aacute; Mundo!
Dia Bonito!
</pre>

<p>Bom, como eu havia dito, isso &eacute; um resumo de como voc&ecirc; deve proceder para internacionalizar um programa. Se voc&ecirc; quiser contribuir para a comunidade (ou para o autor do programa) voc&ecirc; pode criar um patch e enviar para o mesmo. Para fazer isto voc&ecirc; deve proceder da seguinte maneira:</p>

<pre>
# diff -uNr hello-0.0.1.orig hello-0.0.1 &gt; hello-0.0.1-i18n.patch
</pre>

<p>Antes de come&ccedil;ar a internacionalizar um programa eu recomendaria uma leitura da infopage do <tt>gettext</tt>. E se o programa que voc&ecirc; quiser adaptar para o nosso idioma j&aacute; for internacionalizado o seu trabalho ser&aacute; apenas o de traduzir o potfile.</p>
</body>
</html>
