<html>
<head>
   <title>aCiDBaSe HoMe PaGe</title>
   <link rel="STYLESHEET" href="../estilos.css">
</head>

<body bgcolor="#000000">
<pre>
                         xx
                xxxx     xx    xxxx    xxxxx            xxxx
               xx  xx          xx xx   xx  xx          xx  xx
        xxxx   xx  xx  xxxx    xx  xx  xx  xx   xxxx   xx       xxxx
           xx  xx        xx    xx  xx  xx  xx      xx   xx     xx  xx
           xx  xx        xx    xx  xx  xxxxx       xx    xx    xx  xx
        xxxxx  xx        xx    xx  xx  xx  xx   xxxxx     xx   xxxxxx
       xx  xx  xx  xx    xx    xx  xx  xx  xx  xx  xx      xx  xx
       xx  xx  xx  xx    xx    xx xx   xx  xx  xx  xx  xx  xx  xx
        xxxxx   xxxx   xxxxxx  xxxx    xxxxx    xxxxx   xxxx    xxxx
        H      o      M      e                P      a      G      e


<b>Brainf*ck</b>
-------------------------+
                         |
-------------------------+--------------------------------------------------

<b>O que &eacute;?</b>

Brainf*ck &eacute; uma linguagem de programa&ccedil;&atilde;o baseada na linguagem de
programa&ccedil;&atilde;o das m&aacute;quinas de Post e Turing. É uma linguagem extremamente pequena
(8 comandos sem par&acirc;metros), e n&atilde;o &eacute; indicada para uso pr&aacute;tico. Ou seja, voc&ecirc;
n&atilde;o criar&aacute; nenhum programa de controle para v&iacute;deo locadoras com ela.

O aspecto mais importante da linguagem Brainf*ck &eacute; o fato dela despertar o
interesse das pessoas para as m&aacute;quinas algor&iacute;tmicas propostas por Turing e
Post. Tamb&eacute;m pode ser vista como uma linguagem de programa&ccedil;&atilde;o curiosa. Ou at&eacute;
mesmo para voc&ecirc; dizer pros seus amigos que voc&ecirc; programa em Brainf*ck e eles
n&atilde;o.

<b>Um breve tutorial</b>

O funcionamento da linguagem Brainf*ck &eacute; simples e eu tentarei explicar de
forma resumida. Recomendo que voc&ecirc; fa&ccedil;a o download dos fontes do interpretador
e dos exemplos.

Brainf*ck utiliza o conceito de c&eacute;lulas de mem&oacute;ria e ponteiro de mem&oacute;ria para
funcionar. Inicialmente a mem&oacute;ria da 'm&aacute;quina Brainf*ck' &eacute; a seguinte:

Posi&ccedil;&atilde;o: 0     1     2     3     4     5     6     7     8
- - - +-----+-----+-----+-----+-----+-----+-----+-----+-----+ - - -
      |  0  |  0  |  0  |  0  |  0  |  0  |  0  |  0  |  0  |
- - - +-----+-----+-----+-----+-----+-----+-----+-----+-----+ - - -
         ^

O s&iacute;mbolo '^' indica a o ponteiro de mem&oacute;ria e mostra a sua posi&ccedil;&atilde;o inicial
(0). A partir da&iacute;, Brainf*ck disponibiliza os 8 comandos para que voc&ecirc; possa
programar:

+---------+------------------------------------------------------------------+
| Comando | Fun&ccedil;&atilde;o                                                           |
+---------+------------------------------------------------------------------+
|    +    | Incrementa em 1 o valor da c&eacute;lula apontada pelo ponteiro.        |
|    -    | Decrementa em 1 o valor da c&eacute;lula apontada pelo ponteiro.        |
|    &gt;    | Movimenta o ponteiro 1 posi&ccedil;&atilde;o para a direita.                   |
|    &lt;    | Movimenta o ponteiro 1 posi&ccedil;&atilde;o de para a esquerda.               |
|    ,    | Recebe 1 caracter pela entrada padr&atilde;o e (teclado) e joga         |
|         | o seu c&oacute;digo ASCII na posi&ccedil;&atilde;o de mem&oacute;ria apontada pelo ponteiro. |
|    .    | Imprime o caracter com o c&oacute;digo ASCII da posi&ccedil;&atilde;o de mem&oacute;ria      |
|         | apontada pelo ponteiro.                                          |
|    [    | Inicia o loop.                                                   |
|    ]    | Se a posi&ccedil;&atilde;o de mem&oacute;ria apontada pelo ponteiro contiver o valor  |
|         | 0 continua a execu&ccedil;&atilde;o, sen&atilde;o, volta para o '[' mais pr&oacute;ximo.     |
+---------+------------------------------------------------------------------+

Tendo isso em vista, vamos fazer um pequeno programa que imprime o caracter 'A'
na tela. O caracter 'A' possui ASCII code 65. Uma forma de fazer isso seria:

++++++ ...por 65 vezes e . para imprimir

Convenhamos, isso &eacute; muito trabalhoso, logo, podemos fazer 8*8+1=65 para
abreviar nosso trabalho. Isso ficaria assim:

&gt;++++++++[&lt;++++++++&gt;-]&lt;+.

Calma, eu explico. :) Vamos seguir isso passo a passo:

-----------
00 00 00 00    In&iacute;cio
-----------
 ^

-----------
00 00 00 00    &gt;
-----------
    ^ 

-----------
00 08 00 00    ++++++++
-----------
    ^

-----------
00 08 00 00    [   LOOP
-----------
    ^

-----------
00 08 00 00    &lt;
-----------
 ^

-----------
08 08 00 00    ++++++++
-----------
 ^

-----------
08 08 00 00    &gt;
-----------
    ^

-----------
08 07 00 00    -
-----------
    ^

-----------
08 07 00 00    ] &eacute; zero? n&atilde;o? volte pra LOOP. &eacute; zero? siga em frente
-----------
    ^

-----------
64 00 00 00    &lt;
-----------
 ^

-----------
65 00 00 00    +
-----------
 ^

-----------
65 00 00 00    . Imprime a letra 'A'
-----------
 ^

Fim. Ufa! :)

Voc&ecirc;s devem estar pensando: 'Nossa! isso &eacute; muito dif&iacute;cil!' ou 'Nossa! isso n&atilde;o
serve de nada!'. É mais ou menos por a&iacute; :) Esse tipo de linguagem s&oacute; serve para
provar alguns conceitos e n&atilde;o possuem finalidade pr&aacute;tica.

Bom, espero que voc&ecirc;s tenham entendido o b&aacute;sico. Se precisarem de maiores
informa&ccedil;&otilde;es eu recomendo uma visitinha em:

- <a href="http://www.catseye.mb.ca/esoteric/bf/">Cat's Eye</a>
- <a href="http://www2.latech.edu/~acm/helloworld/bf/">Brainf*ck Hello World</a>

E fazer o download do <a href="../download/bfk.tar.bz2">arquivo</a> com o interpretador e alguns exemplos.


</pre>
</body>
</html>
